app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        # debugger
        @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Smashing Pumpkins"], ["created_at", "2021-11-16 21:29:23.575331"], ["updated_at", "2021-11-16 21:29:23.575331"]]
SELECT "bands".* FROM "bands"
---
    def create
        band = Band.new(band_params)
        if band.save
            @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Breaking Pumpkins"], ["updated_at", "2021-11-16 21:54:28.098127"], ["id", 6]]
---
    def update
        @band = Band.find(params[:id])
        @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 6]]
---
    def destroy
        @band = Band.find(params[:id])
        if @band
            @band.destroy