app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:email], params[:user][:password])
        session[:session_token] = SecureRandom::urlsafe_base64(16)
        @user.session_token = session[:session_token]
        @user.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gEdnoAh7mJaCBb699MdUbA"], ["updated_at", "2021-11-16 18:58:56.838891"], ["id", 3]]